// create Arrya -- numbers, questions, options, answers

let questions = [
    {
        numb: 1,
        question: "第一次一起看到的動物是什麼？",
        answer: "A",
        options: [
            "A:蝸牛",
            "B:蟾蜍",
            "C:柴犬",
            "D:英國短毛貓"
        ]
    },
    {
        numb: 2,
        question: "小馬最厲害的特徵",
        answer: "D",
        options: [
            "A:愛打掃",
            "B:社會役",
            "C:社恐",
            "D:鬢角"
        ]
    },
    {
        numb: 3,
        question: "玉米的身高",
        answer: "B",
        options: [
            "A:171.8",
            "B:171.5",
            "C:171.0",
            "D:172.5"
        ]
    },
    {
        numb: 4,
        question: "最近一次一起去看電影，該部男主角叫什麼",
        answer: "D",
        options: [
            "A:勞勃·約翰·伯克",
            "B:馬丁·費里曼",
            "C:艾力克斯·利維納利",
            "D:泰諾克·烏爾塔·梅嘉"
        ]
    },
    {
        numb: 5,
        question: "【甄嬛傳】劇中除了各嬪妃娘娘，許多圍繞在小主身邊的侍女也表現十分亮眼，請根據劇情和人物設定，判斷下列敘述何者正確？",
        answer: "A",
        options: [
            "A:翠果--齊妃侍女，心地善良，在齊妃死後被皇后滅口推進荷花池。",
            "B:寶鵑--安陵容侍女，曾用香灰伴馬尿詛咒他人，後死於亂棍之下。",
            "C:流朱--甄嬛侍女，忠心耿耿，個性直率聰敏，後被侍衛亂刀殺死。",
            "D:頌芝--年世蘭侍女，後封芝答應，最後廢為庶人，幽禁冷宮致死。"
        ]
    },
    {
        numb: 6,
        question: "辰不曾看過哪一篇文章/書/歌詞？",
        answer: "C",
        options: [
            "A:「如果有來生」by三毛",
            "B:「紅樓夢」",
            "C:「看你」by牛乳白",
            "D:「智慧財產權由一構思到專利形成」by謝原泰"
        ]
    },
    {
        numb: 7,
        question: "下列哪段文字，鼠不曾在IG上PO過？",
        answer: "C",
        options: [
            "A:真正需要被拯救的，一直都是我自己",
            "B:傻傻的愛，頻頻回首",
            "C:有你同行會更好 ",
            "D:爬山像是用汗洗澡"
        ]
    },
    {
        numb: 8,
        question: "天下雜誌創刊日期為何時？",
        answer: "A",
        options: [
            "A:民國70年6月1日",
            "B:民國72年6月1日",
            "C:民國71年6月1日",
            "D:民國73年6月1日"
        ]
    },
    {
        numb: 9,
        question: "【甄嬛傳】寧嬪葉瀾依是後期劇情關鍵人物，下列敘述何者正確？(1)曾被一頭豹子弄傷。(2)居住春禧殿，喜歡綠色衣服，侍女為阿綠。(3)因喝下齊妃動過手腳酸梅湯，故終生不育。(4)明白果郡王對甄嬛心意後，屢次暗助甄嬛。(5)滴血驗親事件，親自為甄嬛奔走甘露寺找莫言作證",
        answer: "A",
        options: [
            "A:124",
            "B:1245",
            "C:245",
            "D:134"
        ]
    },
    {
        numb: 10,
        question: "深坑四寶不包含下列何者？",
        answer: "D",
        options: [
            "A:豆腐",
            "B:綠竹筍",
            "C:黑豬肉",
            "D:包種茶"
        ]
    }
]